Autodesk.Revit.DB.Structure.RebarSpliceByRulesRunOutPosition
Describes the run-out position.
Since:
2025
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceByRulesRunOutPosition.End
The rest will remain at the end of the bar.

Autodesk.Revit.DB.Structure.RebarSpliceByRulesRunOutPosition.Start
The rest will remain at the start of the bar.